This is a markdown cell. Use it to make notes.

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
import seaborn as sns

In [9]:
pd.read_csv('../data/gdp_percapita.csv')

     Country or Area  Year        Value  Value Footnotes
0        Afghanistan  2020  1970.560169              NaN
1        Afghanistan  2019  2065.036235              NaN
2        Afghanistan  2018  2033.804389              NaN
3        Afghanistan  2017  2058.400221              NaN
4        Afghanistan  2016  2057.067978              NaN
...              ...   ...          ...              ...
7171        Zimbabwe  1994  2603.927369              NaN
7172        Zimbabwe  1993  2420.092791              NaN
7173        Zimbabwe  1992  2437.152908              NaN
7174        Zimbabwe  1991  2733.696626              NaN
7175        Zimbabwe  1990  2652.129209              NaN

[7176 rows x 4 columns]

In [10]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')

In [12]:
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2020  1970.560169              NaN
1     Afghanistan  2019  2065.036235              NaN
2     Afghanistan  2018  2033.804389              NaN
3     Afghanistan  2017  2058.400221              NaN
4     Afghanistan  2016  2057.067978              NaN
5     Afghanistan  2015  2068.265904              NaN
6     Afghanistan  2014  2102.384604              NaN
7     Afghanistan  2013  2116.465258              NaN
8     Afghanistan  2012  2075.491614              NaN
9     Afghanistan  2011  1904.559926              NaN

In [13]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
7166        Zimbabwe  1999  2872.714795              NaN
7167        Zimbabwe  1998  2915.052992              NaN
7168        Zimbabwe  1997  2856.118188              NaN
7169        Zimbabwe  1996  2808.558556              NaN
7170        Zimbabwe  1995  2573.993785              NaN
7171        Zimbabwe  1994  2603.927369              NaN
7172        Zimbabwe  1993  2420.092791              NaN
7173        Zimbabwe  1992  2437.152908              NaN
7174        Zimbabwe  1991  2733.696626              NaN
7175        Zimbabwe  1990  2652.129209              NaN

There are 7176 rows × 4 columns.

In [14]:
gdp_df.shape

(7176, 4)

In [17]:
gdp_df.iloc[0:5,0:3]

  Country or Area  Year        Value
0     Afghanistan  2020  1970.560169
1     Afghanistan  2019  2065.036235
2     Afghanistan  2018  2033.804389
3     Afghanistan  2017  2058.400221
4     Afghanistan  2016  2057.067978

In [20]:
gdp_df.loc[gdp_df['Country or Area'] == 'Afghanistan']

   Country or Area  Year        Value  Value Footnotes
0      Afghanistan  2020  1970.560169              NaN
1      Afghanistan  2019  2065.036235              NaN
2      Afghanistan  2018  2033.804389              NaN
3      Afghanistan  2017  2058.400221              NaN
4      Afghanistan  2016  2057.067978              NaN
5      Afghanistan  2015  2068.265904              NaN
6      Afghanistan  2014  2102.384604              NaN
7      Afghanistan  2013  2116.465258              NaN
8      Afghanistan  2012  2075.491614              NaN
9      Afghanistan  2011  1904.559926              NaN
10     Afghanistan  2010  1957.029070              NaN
11     Afghanistan  2009  1758.904477              NaN
12     Afghanistan  2008  1484.114461              NaN
13     Afghanistan  2007  1460.825751              NaN
14     Afghanistan  2006  1315.789117              NaN
15     Afghanistan  2005  1286.793659              NaN
16     Afghanistan  2004  1200.278013              NaN
17     Afghanistan  2003  1235.810063              NaN
18     Afghanistan  2002  1189.784668              NaN

In [21]:
gdp_df.Year.value_counts()

Year
2018    242
2017    242
2016    242
2015    242
2014    242
2013    242
2019    241
2020    240
2012    240
2011    240
2010    239
2009    239
2008    238
2007    237
2006    237
2004    236
2005    236
2003    235
2002    235
2001    234
2000    233
1999    227
1998    226
1997    226
1996    222
1995    222
1994    211
1993    209
1992    208
1991    207
1990    206
Name: count, dtype: int64

I am not sure how to look up the data type of the column. Is it that "int64?

In [26]:
type(gdp_df)

pandas.core.frame.DataFrame

In [28]:
type(gdp_df.Year)

pandas.core.series.Series

In [30]:
type(gdp_df.Country)

AttributeError: 'DataFrame' object has no attribute 'Country'

In [31]:
type(Year)

NameError: name 'Year' is not defined

FROM README #5 what are the data types of each column?